note/drawio/converted/dot/260420-top-timer-timepiece-project.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_2trcLsQLmsmYuEsOdBA8_2" [label="node_dBA8-2"];
  "n_2trcLsQLmsmYuEsOdBA8_3" [label="node_dBA8-3"];
  "n_2trcLsQLmsmYuEsOdBA8_4" [label="node_dBA8-4"];
  "n_3sv_IS42M_PzI3kGq3iH_1" [label="node_q3iH-1"];
  "n_3sv_IS42M_PzI3kGq3iH_2" [label="timer_unit"];
  "n_3sv_IS42M_PzI3kGq3iH_3" [label="timepiece_unit"];
  "n_3sv_IS42M_PzI3kGq3iH_4" [label="display_unit"];
  "n_e8PLG3kEcCTFos2G7Ypj_3" [label="node_7Ypj-3"];
  "n_e8PLG3kEcCTFos2G7Ypj_4" [label="node_7Ypj-4"];
  "n_e8PLG3kEcCTFos2G7Ypj_5" [label="node_7Ypj-5"];
  "n_e8PLG3kEcCTFos2G7Ypj_6" [label="node_7Ypj-6"];
  "n_e8PLG3kEcCTFos2G7Ypj_7" [label="node_7Ypj-7"];
  "n_e8PLG3kEcCTFos2G7Ypj_8" [label="node_7Ypj-8"];
  "n_nbyKZ8UsinEBuoknLQGr_14" [label="timepiece_fsm"];
  "n_nbyKZ8UsinEBuoknLQGr_21" [label="common_fsm"];
  "n_nbyKZ8UsinEBuoknLQGr_3" [label="Bnt_L"];
  "n_nbyKZ8UsinEBuoknLQGr_4" [label="timer_fsm"];
  "n_nbyKZ8UsinEBuoknLQGr_44" [label="timepiece_datapath"];
  "n_nbyKZ8UsinEBuoknLQGr_5" [label="Bnt_U"];
  "n_nbyKZ8UsinEBuoknLQGr_59" [label="timer_datapath"];
  "n_nbyKZ8UsinEBuoknLQGr_6" [label="Bnt_D"];
  "n_nbyKZ8UsinEBuoknLQGr_69" [label="display_select_logic"];
  "n_nbyKZ8UsinEBuoknLQGr_7" [label="Bnt_R"];
  "n_nbyKZ8UsinEBuoknLQGr_71" [label="fnd_controller"];
  "n_nbyKZ8UsinEBuoknLQGr_88" [label="node_QGr-88"];
  "n_nbyKZ8UsinEBuoknLQGr_90" [label="input_conditioning"];
  "n_nbyKZ8UsinEBuoknLQGr_91" [label="sw[0]"];
  "n_nbyKZ8UsinEBuoknLQGr_92" [label="sw[15]"];
  "n_nbyKZ8UsinEBuoknLQGr_4" -> "n_nbyKZ8UsinEBuoknLQGr_59";
  "n_nbyKZ8UsinEBuoknLQGr_4" -> "n_nbyKZ8UsinEBuoknLQGr_59";
  "n_nbyKZ8UsinEBuoknLQGr_59" -> "n_nbyKZ8UsinEBuoknLQGr_69";
  "n_nbyKZ8UsinEBuoknLQGr_44" -> "n_nbyKZ8UsinEBuoknLQGr_69";
  "n_nbyKZ8UsinEBuoknLQGr_71" -> "n_e8PLG3kEcCTFos2G7Ypj_4";
  "n_nbyKZ8UsinEBuoknLQGr_71" -> "n_e8PLG3kEcCTFos2G7Ypj_4";
  "n_nbyKZ8UsinEBuoknLQGr_69" -> "n_nbyKZ8UsinEBuoknLQGr_71";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_4";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_4";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_4";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_21";
  "n_nbyKZ8UsinEBuoknLQGr_91" -> "n_nbyKZ8UsinEBuoknLQGr_90";
  "n_nbyKZ8UsinEBuoknLQGr_92" -> "n_nbyKZ8UsinEBuoknLQGr_90";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_69";
  "n_nbyKZ8UsinEBuoknLQGr_90" -> "n_nbyKZ8UsinEBuoknLQGr_69";
  "n_nbyKZ8UsinEBuoknLQGr_21" -> "n_nbyKZ8UsinEBuoknLQGr_71";
  "n_nbyKZ8UsinEBuoknLQGr_14" -> "n_nbyKZ8UsinEBuoknLQGr_71";
}
